# Terminal
brew "exa"                # Modern replacement for ls
brew "ghq"                # Manage remote repository clones
brew "peco"               # Simplistic interactive filtering tool
brew "fzf"
brew "direnv"

# Languages & tools
brew "go"
brew "cue-lang/tap/cue"
brew "dagger/tap/dagger"

# Kubernetes
brew "lima"               # Linux Virtual Machines (containerd)
brew "kubectl"
#brew "krew"              # kubectl plugin manager

# Neovim
brew "tree-sitter", args: ['HEAD']
brew "luajit", args: ['HEAD']
brew "neovim", args: ['HEAD']


# macOS
tap "homebrew/cask-fonts"
cask "font-fira-code-nerd-font"
cask "raycast"
cask "1password-cli"

#mas "1Password", id: 443987910 # Awaiting 8
mas "Adobe Lightroom", id: 1451544217

